In [55]:
import pandas as pd

In [56]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [57]:
df.drop(['Name','PassengerId','SibSp','Ticket','Cabin','Embarked','Parch'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [58]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [59]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [60]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

   female  male
0       0     1
1       1     0
2       1     0

In [61]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [62]:
inputs.drop('Sex',axis='columns',inplace=True)

In [63]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [64]:
#find Nan value in table 
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [66]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [67]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [69]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [70]:
len(X_train)

623

In [71]:
len(y_train)

623

In [72]:
len(X_test)

268

In [73]:
len(inputs)

891

In [74]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [76]:
model.fit(X_train,y_train)

GaussianNB()

In [77]:
model.score(X_train,y_train)

0.7865168539325843

In [78]:
X_test[:5]

     Pclass   Age     Fare  female  male
283       3  19.0   8.0500       0     1
234       2  24.0  10.5000       0     1
382       3  32.0   7.9250       0     1
765       1  51.0  77.9583       1     0
749       3  31.0   7.7500       0     1

In [81]:
y_test[:5]

283    1
234    0
382    0
765    1
749    0
Name: Survived, dtype: int64

In [82]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 0, 0, 1, 1, 0, 0], dtype=int64)

In [83]:
model.predict_proba(X_test[:10]) #[0.99020692 death prob, 0.00979308 alive prob]

array([[0.99020692, 0.00979308],
       [0.97881787, 0.02118213],
       [0.99182275, 0.00817725],
       [0.00126956, 0.99873044],
       [0.9917351 , 0.0082649 ],
       [0.98977971, 0.01022029],
       [0.01545029, 0.98454971],
       [0.02073407, 0.97926593],
       [0.99210299, 0.00789701],
       [0.99162627, 0.00837373]])